hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_mtgv2_regs.h
/*
 * ACC_SHIFT (RW)
 *
 */
#define MTGV2_TRA_SHIFT_ACC_SHIFT_MASK (0x70U)
#define MTGV2_TRA_SHIFT_ACC_SHIFT_SHIFT (4U)
#define MTGV2_TRA_SHIFT_ACC_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_TRA_SHIFT_ACC_SHIFT_SHIFT) & MTGV2_TRA_SHIFT_ACC_SHIFT_MASK)
#define MTGV2_TRA_SHIFT_ACC_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_TRA_SHIFT_ACC_SHIFT_MASK) >> MTGV2_TRA_SHIFT_ACC_SHIFT_SHIFT)

/*
 * VEL_SHIFT (RW)
 *
 */
#define MTGV2_TRA_SHIFT_VEL_SHIFT_MASK (0xFU)
#define MTGV2_TRA_SHIFT_VEL_SHIFT_SHIFT (0U)
#define MTGV2_TRA_SHIFT_VEL_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_TRA_SHIFT_VEL_SHIFT_SHIFT) & MTGV2_TRA_SHIFT_VEL_SHIFT_MASK)
#define MTGV2_TRA_SHIFT_VEL_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_TRA_SHIFT_VEL_SHIFT_MASK) >> MTGV2_TRA_SHIFT_VEL_SHIFT_SHIFT)

/* Bitfield definition for register of struct array TRA: LINK */
/*
 * LINK_CFG_3 (RW)
 *
 */
#define MTGV2_TRA_LINK_LINK_CFG_3_MASK (0x7000U)
#define MTGV2_TRA_LINK_LINK_CFG_3_SHIFT (12U)
#define MTGV2_TRA_LINK_LINK_CFG_3_SET(x) (((uint32_t)(x) << MTGV2_TRA_LINK_LINK_CFG_3_SHIFT) & MTGV2_TRA_LINK_LINK_CFG_3_MASK)
#define MTGV2_TRA_LINK_LINK_CFG_3_GET(x) (((uint32_t)(x) & MTGV2_TRA_LINK_LINK_CFG_3_MASK) >> MTGV2_TRA_LINK_LINK_CFG_3_SHIFT)

/*
 * LINK_CFG_2 (RW)
 *
 */
#define MTGV2_TRA_LINK_LINK_CFG_2_MASK (0x700U)
#define MTGV2_TRA_LINK_LINK_CFG_2_SHIFT (8U)
#define MTGV2_TRA_LINK_LINK_CFG_2_SET(x) (((uint32_t)(x) << MTGV2_TRA_LINK_LINK_CFG_2_SHIFT) & MTGV2_TRA_LINK_LINK_CFG_2_MASK)
#define MTGV2_TRA_LINK_LINK_CFG_2_GET(x) (((uint32_t)(x) & MTGV2_TRA_LINK_LINK_CFG_2_MASK) >> MTGV2_TRA_LINK_LINK_CFG_2_SHIFT)

/*
 * LINK_CFG_1 (RW)
 *
 */
#define MTGV2_TRA_LINK_LINK_CFG_1_MASK (0x70U)
#define MTGV2_TRA_LINK_LINK_CFG_1_SHIFT (4U)
#define MTGV2_TRA_LINK_LINK_CFG_1_SET(x) (((uint32_t)(x) << MTGV2_TRA_LINK_LINK_CFG_1_SHIFT) & MTGV2_TRA_LINK_LINK_CFG_1_MASK)
#define MTGV2_TRA_LINK_LINK_CFG_1_GET(x) (((uint32_t)(x) & MTGV2_TRA_LINK_LINK_CFG_1_MASK) >> MTGV2_TRA_LINK_LINK_CFG_1_SHIFT)

/*
 * LINK_CFG_0 (RW)
 *
 */
#define MTGV2_TRA_LINK_LINK_CFG_0_MASK (0x7U)
#define MTGV2_TRA_LINK_LINK_CFG_0_SHIFT (0U)
#define MTGV2_TRA_LINK_LINK_CFG_0_SET(x) (((uint32_t)(x) << MTGV2_TRA_LINK_LINK_CFG_0_SHIFT) & MTGV2_TRA_LINK_LINK_CFG_0_MASK)
#define MTGV2_TRA_LINK_LINK_CFG_0_GET(x) (((uint32_t)(x) & MTGV2_TRA_LINK_LINK_CFG_0_MASK) >> MTGV2_TRA_LINK_LINK_CFG_0_SHIFT)

/* Bitfield definition for register of struct array TRA: CONTROL */
/*
 * MODE (RW)
 *
 */
#define MTGV2_TRA_CMD_CONTROL_MODE_MASK (0x20000000UL)
#define MTGV2_TRA_CMD_CONTROL_MODE_SHIFT (29U)
#define MTGV2_TRA_CMD_CONTROL_MODE_SET(x) (((uint32_t)(x) << MTGV2_TRA_CMD_CONTROL_MODE_SHIFT) & MTGV2_TRA_CMD_CONTROL_MODE_MASK)
#define MTGV2_TRA_CMD_CONTROL_MODE_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_CONTROL_MODE_MASK) >> MTGV2_TRA_CMD_CONTROL_MODE_SHIFT)

/*
 * OBJECT (RW)
 *
 */
#define MTGV2_TRA_CMD_CONTROL_OBJECT_MASK (0x1FU)
#define MTGV2_TRA_CMD_CONTROL_OBJECT_SHIFT (0U)
#define MTGV2_TRA_CMD_CONTROL_OBJECT_SET(x) (((uint32_t)(x) << MTGV2_TRA_CMD_CONTROL_OBJECT_SHIFT) & MTGV2_TRA_CMD_CONTROL_OBJECT_MASK)
#define MTGV2_TRA_CMD_CONTROL_OBJECT_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_CONTROL_OBJECT_MASK) >> MTGV2_TRA_CMD_CONTROL_OBJECT_SHIFT)

/* Bitfield definition for register of struct array TRA: REV_PRESET */
/*
 * REV_PRESET (RW)
 *
 */
#define MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_SHIFT (0U)
#define MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_SET(x) (((uint32_t)(x) << MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_SHIFT) & MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_MASK)
#define MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_MASK) >> MTGV2_TRA_CMD_REV_PRESET_REV_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: POS_PRESET */
/*
 * POS_PRESET (RW)
 *
 */
#define MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_SHIFT (0U)
#define MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_SET(x) (((uint32_t)(x) << MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_SHIFT) & MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_MASK)
#define MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_MASK) >> MTGV2_TRA_CMD_POS_PRESET_POS_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_PRESET */
/*
 * VEL_PRESET (RW)
 *
 */
#define MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_SHIFT (0U)
#define MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_SET(x) (((uint32_t)(x) << MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_SHIFT) & MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_MASK)
#define MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_MASK) >> MTGV2_TRA_CMD_VEL_PRESET_VEL_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: ACC_PRESET */
/*
 * ACC_PRESET (RW)
 *
 */
#define MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_SHIFT (0U)
#define MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_SET(x) (((uint32_t)(x) << MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_SHIFT) & MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_MASK)
#define MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_MASK) >> MTGV2_TRA_CMD_ACC_PRESET_ACC_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: JER_PRESET */
/*
 * JER_PRESET (RW)
 *
 */
#define MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_SHIFT (0U)
#define MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_SET(x) (((uint32_t)(x) << MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_SHIFT) & MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_MASK)
#define MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_MASK) >> MTGV2_TRA_CMD_JER_PRESET_JER_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: TIMESTAMP */
/*
 * TIMESTAMP (RO)
 *
 */
#define MTGV2_TRA_CMD_TIMESTAMP_TIMESTAMP_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_CMD_TIMESTAMP_TIMESTAMP_SHIFT (0U)
#define MTGV2_TRA_CMD_TIMESTAMP_TIMESTAMP_GET(x) (((uint32_t)(x) & MTGV2_TRA_CMD_TIMESTAMP_TIMESTAMP_MASK) >> MTGV2_TRA_CMD_TIMESTAMP_TIMESTAMP_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_REV */
/*
 * LOCK_REV (RO)
 *
 */
#define MTGV2_TRA_LOCK_REV_LOCK_REV_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_LOCK_REV_LOCK_REV_SHIFT (0U)
#define MTGV2_TRA_LOCK_REV_LOCK_REV_GET(x) (((uint32_t)(x) & MTGV2_TRA_LOCK_REV_LOCK_REV_MASK) >> MTGV2_TRA_LOCK_REV_LOCK_REV_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_POS */
/*
 * LOCK_POS (RO)
 *
 */
#define MTGV2_TRA_LOCK_POS_LOCK_POS_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_LOCK_POS_LOCK_POS_SHIFT (0U)
#define MTGV2_TRA_LOCK_POS_LOCK_POS_GET(x) (((uint32_t)(x) & MTGV2_TRA_LOCK_POS_LOCK_POS_MASK) >> MTGV2_TRA_LOCK_POS_LOCK_POS_SHIFT)

