hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_mtgv2_regs.h
/* Bitfield definition for register of struct array TRA: LOCK_VEL */
/*
 * LOCK_VEL (RO)
 *
 */
#define MTGV2_TRA_LOCK_VEL_LOCK_VEL_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_LOCK_VEL_LOCK_VEL_SHIFT (0U)
#define MTGV2_TRA_LOCK_VEL_LOCK_VEL_GET(x) (((uint32_t)(x) & MTGV2_TRA_LOCK_VEL_LOCK_VEL_MASK) >> MTGV2_TRA_LOCK_VEL_LOCK_VEL_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_ACC */
/*
 * LOCK_ACC (RO)
 *
 */
#define MTGV2_TRA_LOCK_ACC_LOCK_ACC_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_LOCK_ACC_LOCK_ACC_SHIFT (0U)
#define MTGV2_TRA_LOCK_ACC_LOCK_ACC_GET(x) (((uint32_t)(x) & MTGV2_TRA_LOCK_ACC_LOCK_ACC_MASK) >> MTGV2_TRA_LOCK_ACC_LOCK_ACC_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_TIME */
/*
 * LOCK_TIME (RO)
 *
 */
#define MTGV2_TRA_LOCK_TIME_LOCK_TIME_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_LOCK_TIME_LOCK_TIME_SHIFT (0U)
#define MTGV2_TRA_LOCK_TIME_LOCK_TIME_GET(x) (((uint32_t)(x) & MTGV2_TRA_LOCK_TIME_LOCK_TIME_MASK) >> MTGV2_TRA_LOCK_TIME_LOCK_TIME_SHIFT)

/* Bitfield definition for register of struct array TRA: STEP_LIMIT_CTRL */
/*
 * POS_ONE_WAY_FORCE_MODE (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_MASK (0x1000U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SHIFT (12U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SHIFT)

/*
 * POS_ONE_WAY_MODE (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_MASK (0x800U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SHIFT (11U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SHIFT)

/*
 * POS_ONE_WAY_EN (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_MASK (0x400U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SHIFT (10U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SHIFT)

/*
 * POS_STEP_MODE (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_MASK (0x200U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SHIFT (9U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SHIFT)

/*
 * POS_STEP_EN (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_MASK (0x100U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SHIFT (8U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SHIFT)

/*
 * VEL_ONE_WAY_MODE (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_MASK (0x4U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SHIFT (2U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SHIFT)

/*
 * VEL_ONE_WAY_EN (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_MASK (0x2U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SHIFT (1U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SHIFT)

/*
 * VEL_STEP_EN (RW)
 *
 */
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_MASK (0x1U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SHIFT (0U)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SET(x) (((uint32_t)(x) << MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SHIFT) & MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_MASK)
#define MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_GET(x) (((uint32_t)(x) & MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_MASK) >> MTGV2_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_STEP_MAX */
/*
 * VEL_STEP_MAX (RW)
 *
 */
#define MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SHIFT (0U)
#define MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SET(x) (((uint32_t)(x) << MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SHIFT) & MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_MASK)
#define MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_GET(x) (((uint32_t)(x) & MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_MASK) >> MTGV2_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_STEP_MIN */
/*
 * VEL_STEP_MIN (RW)
 *
 */
#define MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SHIFT (0U)
#define MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SET(x) (((uint32_t)(x) << MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SHIFT) & MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_MASK)
#define MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_GET(x) (((uint32_t)(x) & MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_MASK) >> MTGV2_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SHIFT)

/* Bitfield definition for register of struct array TRA: POS_STEP_MAX */
/*
 * POS_STEP_MAX (RW)
 *
 */
#define MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_SHIFT (0U)
#define MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_SET(x) (((uint32_t)(x) << MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_SHIFT) & MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_MASK)
#define MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_GET(x) (((uint32_t)(x) & MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_MASK) >> MTGV2_TRA_POS_STEP_MAX_POS_STEP_MAX_SHIFT)

/* Bitfield definition for register of struct array TRA: POS_STEP_MIN */
/*
 * POS_STEP_MIN (RW)
 *
 */
#define MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_SHIFT (0U)
#define MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_SET(x) (((uint32_t)(x) << MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_SHIFT) & MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_MASK)
#define MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_GET(x) (((uint32_t)(x) & MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_MASK) >> MTGV2_TRA_POS_STEP_MIN_POS_STEP_MIN_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_LIMIT_P */
/*
 * VEL_LIMIT_P (RW)
 *
 */
#define MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SHIFT (0U)
#define MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SET(x) (((uint32_t)(x) << MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SHIFT) & MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_MASK)
#define MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_GET(x) (((uint32_t)(x) & MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_MASK) >> MTGV2_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_LIMIT_N */
/*
 * VEL_LIMIT_N (RW)
 *
 */
#define MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_MASK (0xFFFFFFFFUL)
#define MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SHIFT (0U)
#define MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SET(x) (((uint32_t)(x) << MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SHIFT) & MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_MASK)
#define MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_GET(x) (((uint32_t)(x) & MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_MASK) >> MTGV2_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SHIFT)

/* Bitfield definition for register of struct array EVENT: CONTROL */
/*
 * ENABLE (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_ENABLE_MASK (0x80000000UL)
#define MTGV2_EVENT_CONTROL_ENABLE_SHIFT (31U)
#define MTGV2_EVENT_CONTROL_ENABLE_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_ENABLE_SHIFT) & MTGV2_EVENT_CONTROL_ENABLE_MASK)
#define MTGV2_EVENT_CONTROL_ENABLE_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_ENABLE_MASK) >> MTGV2_EVENT_CONTROL_ENABLE_SHIFT)

