hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_mtgv2_regs.h
/*
 * SOURCE_MUX (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_SOURCE_MUX_MASK (0x7C000000UL)
#define MTGV2_EVENT_CONTROL_SOURCE_MUX_SHIFT (26U)
#define MTGV2_EVENT_CONTROL_SOURCE_MUX_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_SOURCE_MUX_SHIFT) & MTGV2_EVENT_CONTROL_SOURCE_MUX_MASK)
#define MTGV2_EVENT_CONTROL_SOURCE_MUX_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_SOURCE_MUX_MASK) >> MTGV2_EVENT_CONTROL_SOURCE_MUX_SHIFT)

/*
 * OBJECT (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_OBJECT_MASK (0x3C00000UL)
#define MTGV2_EVENT_CONTROL_OBJECT_SHIFT (22U)
#define MTGV2_EVENT_CONTROL_OBJECT_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_OBJECT_SHIFT) & MTGV2_EVENT_CONTROL_OBJECT_MASK)
#define MTGV2_EVENT_CONTROL_OBJECT_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_OBJECT_MASK) >> MTGV2_EVENT_CONTROL_OBJECT_SHIFT)

/*
 * MODE (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_MODE_MASK (0x3C0000UL)
#define MTGV2_EVENT_CONTROL_MODE_SHIFT (18U)
#define MTGV2_EVENT_CONTROL_MODE_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_MODE_SHIFT) & MTGV2_EVENT_CONTROL_MODE_MASK)
#define MTGV2_EVENT_CONTROL_MODE_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_MODE_MASK) >> MTGV2_EVENT_CONTROL_MODE_SHIFT)

/*
 * DIR (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_DIR_MASK (0x30000UL)
#define MTGV2_EVENT_CONTROL_DIR_SHIFT (16U)
#define MTGV2_EVENT_CONTROL_DIR_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_DIR_SHIFT) & MTGV2_EVENT_CONTROL_DIR_MASK)
#define MTGV2_EVENT_CONTROL_DIR_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_DIR_MASK) >> MTGV2_EVENT_CONTROL_DIR_SHIFT)

/*
 * DIR_MODE (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_DIR_MODE_MASK (0x8000U)
#define MTGV2_EVENT_CONTROL_DIR_MODE_SHIFT (15U)
#define MTGV2_EVENT_CONTROL_DIR_MODE_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_DIR_MODE_SHIFT) & MTGV2_EVENT_CONTROL_DIR_MODE_MASK)
#define MTGV2_EVENT_CONTROL_DIR_MODE_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_DIR_MODE_MASK) >> MTGV2_EVENT_CONTROL_DIR_MODE_SHIFT)

/*
 * CMP_MODE (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_CMP_MODE_MASK (0x4000U)
#define MTGV2_EVENT_CONTROL_CMP_MODE_SHIFT (14U)
#define MTGV2_EVENT_CONTROL_CMP_MODE_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_CMP_MODE_SHIFT) & MTGV2_EVENT_CONTROL_CMP_MODE_MASK)
#define MTGV2_EVENT_CONTROL_CMP_MODE_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_CMP_MODE_MASK) >> MTGV2_EVENT_CONTROL_CMP_MODE_SHIFT)

/*
 * TRIG_NUM (RW)
 *
 */
#define MTGV2_EVENT_CONTROL_TRIG_NUM_MASK (0x2000U)
#define MTGV2_EVENT_CONTROL_TRIG_NUM_SHIFT (13U)
#define MTGV2_EVENT_CONTROL_TRIG_NUM_SET(x) (((uint32_t)(x) << MTGV2_EVENT_CONTROL_TRIG_NUM_SHIFT) & MTGV2_EVENT_CONTROL_TRIG_NUM_MASK)
#define MTGV2_EVENT_CONTROL_TRIG_NUM_GET(x) (((uint32_t)(x) & MTGV2_EVENT_CONTROL_TRIG_NUM_MASK) >> MTGV2_EVENT_CONTROL_TRIG_NUM_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_0 */
/*
 * PRESET (RW)
 *
 */
#define MTGV2_EVENT_PRESET_0_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_EVENT_PRESET_0_PRESET_SHIFT (0U)
#define MTGV2_EVENT_PRESET_0_PRESET_SET(x) (((uint32_t)(x) << MTGV2_EVENT_PRESET_0_PRESET_SHIFT) & MTGV2_EVENT_PRESET_0_PRESET_MASK)
#define MTGV2_EVENT_PRESET_0_PRESET_GET(x) (((uint32_t)(x) & MTGV2_EVENT_PRESET_0_PRESET_MASK) >> MTGV2_EVENT_PRESET_0_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_1 */
/*
 * PRESET (RW)
 *
 */
#define MTGV2_EVENT_PRESET_1_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_EVENT_PRESET_1_PRESET_SHIFT (0U)
#define MTGV2_EVENT_PRESET_1_PRESET_SET(x) (((uint32_t)(x) << MTGV2_EVENT_PRESET_1_PRESET_SHIFT) & MTGV2_EVENT_PRESET_1_PRESET_MASK)
#define MTGV2_EVENT_PRESET_1_PRESET_GET(x) (((uint32_t)(x) & MTGV2_EVENT_PRESET_1_PRESET_MASK) >> MTGV2_EVENT_PRESET_1_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_2 */
/*
 * PRESET (RW)
 *
 */
#define MTGV2_EVENT_PRESET_2_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_EVENT_PRESET_2_PRESET_SHIFT (0U)
#define MTGV2_EVENT_PRESET_2_PRESET_SET(x) (((uint32_t)(x) << MTGV2_EVENT_PRESET_2_PRESET_SHIFT) & MTGV2_EVENT_PRESET_2_PRESET_MASK)
#define MTGV2_EVENT_PRESET_2_PRESET_GET(x) (((uint32_t)(x) & MTGV2_EVENT_PRESET_2_PRESET_MASK) >> MTGV2_EVENT_PRESET_2_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_3 */
/*
 * PRESET (RW)
 *
 */
#define MTGV2_EVENT_PRESET_3_PRESET_MASK (0xFFFFFFFFUL)
#define MTGV2_EVENT_PRESET_3_PRESET_SHIFT (0U)
#define MTGV2_EVENT_PRESET_3_PRESET_SET(x) (((uint32_t)(x) << MTGV2_EVENT_PRESET_3_PRESET_SHIFT) & MTGV2_EVENT_PRESET_3_PRESET_MASK)
#define MTGV2_EVENT_PRESET_3_PRESET_GET(x) (((uint32_t)(x) & MTGV2_EVENT_PRESET_3_PRESET_MASK) >> MTGV2_EVENT_PRESET_3_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: TIMESTAMP */
/*
 * TIMESTAMP (RO)
 *
 */
#define MTGV2_EVENT_TIMESTAMP_TIMESTAMP_MASK (0xFFFFFFFFUL)
#define MTGV2_EVENT_TIMESTAMP_TIMESTAMP_SHIFT (0U)
#define MTGV2_EVENT_TIMESTAMP_TIMESTAMP_GET(x) (((uint32_t)(x) & MTGV2_EVENT_TIMESTAMP_TIMESTAMP_MASK) >> MTGV2_EVENT_TIMESTAMP_TIMESTAMP_SHIFT)

/* Bitfield definition for register: SW_EVENT */
/*
 * SW_EVENT_TRIG (RW)
 *
 */
#define MTGV2_SW_EVENT_SW_EVENT_TRIG_MASK (0x1U)
#define MTGV2_SW_EVENT_SW_EVENT_TRIG_SHIFT (0U)
#define MTGV2_SW_EVENT_SW_EVENT_TRIG_SET(x) (((uint32_t)(x) << MTGV2_SW_EVENT_SW_EVENT_TRIG_SHIFT) & MTGV2_SW_EVENT_SW_EVENT_TRIG_MASK)
#define MTGV2_SW_EVENT_SW_EVENT_TRIG_GET(x) (((uint32_t)(x) & MTGV2_SW_EVENT_SW_EVENT_TRIG_MASK) >> MTGV2_SW_EVENT_SW_EVENT_TRIG_SHIFT)

/* Bitfield definition for register: SW_GLB_RESET */
/*
 * SW_GLB_RESET (WO)
 *
 */
#define MTGV2_SW_GLB_RESET_SW_GLB_RESET_MASK (0x1U)
#define MTGV2_SW_GLB_RESET_SW_GLB_RESET_SHIFT (0U)
#define MTGV2_SW_GLB_RESET_SW_GLB_RESET_SET(x) (((uint32_t)(x) << MTGV2_SW_GLB_RESET_SW_GLB_RESET_SHIFT) & MTGV2_SW_GLB_RESET_SW_GLB_RESET_MASK)
#define MTGV2_SW_GLB_RESET_SW_GLB_RESET_GET(x) (((uint32_t)(x) & MTGV2_SW_GLB_RESET_SW_GLB_RESET_MASK) >> MTGV2_SW_GLB_RESET_SW_GLB_RESET_SHIFT)

/* Bitfield definition for register: IRQ_ENABLE */
/*
 * IRQ_ENABLE (RW)
 *
 */
#define MTGV2_IRQ_ENABLE_IRQ_ENABLE_MASK (0xFFFFFFFUL)
#define MTGV2_IRQ_ENABLE_IRQ_ENABLE_SHIFT (0U)
#define MTGV2_IRQ_ENABLE_IRQ_ENABLE_SET(x) (((uint32_t)(x) << MTGV2_IRQ_ENABLE_IRQ_ENABLE_SHIFT) & MTGV2_IRQ_ENABLE_IRQ_ENABLE_MASK)
#define MTGV2_IRQ_ENABLE_IRQ_ENABLE_GET(x) (((uint32_t)(x) & MTGV2_IRQ_ENABLE_IRQ_ENABLE_MASK) >> MTGV2_IRQ_ENABLE_IRQ_ENABLE_SHIFT)

