hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_mtgv2_regs.h
/* Bitfield definition for register: IRQ_STATUS */
/*
 * IRQ_STATUS (W1C)
 *
 */
#define MTGV2_IRQ_STATUS_IRQ_STATUS_MASK (0xFFFFFFFUL)
#define MTGV2_IRQ_STATUS_IRQ_STATUS_SHIFT (0U)
#define MTGV2_IRQ_STATUS_IRQ_STATUS_SET(x) (((uint32_t)(x) << MTGV2_IRQ_STATUS_IRQ_STATUS_SHIFT) & MTGV2_IRQ_STATUS_IRQ_STATUS_MASK)
#define MTGV2_IRQ_STATUS_IRQ_STATUS_GET(x) (((uint32_t)(x) & MTGV2_IRQ_STATUS_IRQ_STATUS_MASK) >> MTGV2_IRQ_STATUS_IRQ_STATUS_SHIFT)

/* Bitfield definition for register: FILTER_CONTROL */
/*
 * ERR_INIT_EN (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_ERR_INIT_EN_MASK (0x80000000UL)
#define MTGV2_FILTER_CONTROL_ERR_INIT_EN_SHIFT (31U)
#define MTGV2_FILTER_CONTROL_ERR_INIT_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_ERR_INIT_EN_SHIFT) & MTGV2_FILTER_CONTROL_ERR_INIT_EN_MASK)
#define MTGV2_FILTER_CONTROL_ERR_INIT_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_ERR_INIT_EN_MASK) >> MTGV2_FILTER_CONTROL_ERR_INIT_EN_SHIFT)

/*
 * ERR_BYPASS_EN (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_MASK (0x40000000UL)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_SHIFT (30U)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_SHIFT) & MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_MASK)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_MASK) >> MTGV2_FILTER_CONTROL_ERR_BYPASS_EN_SHIFT)

/*
 * ERR_BYPASS_MODE (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_MASK (0x20000000UL)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_SHIFT (29U)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_SHIFT) & MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_MASK)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_MASK) >> MTGV2_FILTER_CONTROL_ERR_BYPASS_MODE_SHIFT)

/*
 * ERR_BYPASS_I_F_EN (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_MASK (0x10000000UL)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SHIFT (28U)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SHIFT) & MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_MASK)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_MASK) >> MTGV2_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SHIFT)

/*
 * ERR_BYPASS_F_I_EN (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_MASK (0x8000000UL)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SHIFT (27U)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SHIFT) & MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_MASK)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_MASK) >> MTGV2_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SHIFT)

/*
 * ERR_BYPASS_STATUS (RO)
 *
 */
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_STATUS_MASK (0x4000000UL)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_STATUS_SHIFT (26U)
#define MTGV2_FILTER_CONTROL_ERR_BYPASS_STATUS_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_ERR_BYPASS_STATUS_MASK) >> MTGV2_FILTER_CONTROL_ERR_BYPASS_STATUS_SHIFT)

/*
 * SW_LOCK (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_SW_LOCK_MASK (0x100000UL)
#define MTGV2_FILTER_CONTROL_SW_LOCK_SHIFT (20U)
#define MTGV2_FILTER_CONTROL_SW_LOCK_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_SW_LOCK_SHIFT) & MTGV2_FILTER_CONTROL_SW_LOCK_MASK)
#define MTGV2_FILTER_CONTROL_SW_LOCK_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_SW_LOCK_MASK) >> MTGV2_FILTER_CONTROL_SW_LOCK_SHIFT)

/*
 * TIMEOUT_EN (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_TIMEOUT_EN_MASK (0x80000UL)
#define MTGV2_FILTER_CONTROL_TIMEOUT_EN_SHIFT (19U)
#define MTGV2_FILTER_CONTROL_TIMEOUT_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_TIMEOUT_EN_SHIFT) & MTGV2_FILTER_CONTROL_TIMEOUT_EN_MASK)
#define MTGV2_FILTER_CONTROL_TIMEOUT_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_TIMEOUT_EN_MASK) >> MTGV2_FILTER_CONTROL_TIMEOUT_EN_SHIFT)

/*
 * SEL_TIME1 (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_SEL_TIME1_MASK (0x3000U)
#define MTGV2_FILTER_CONTROL_SEL_TIME1_SHIFT (12U)
#define MTGV2_FILTER_CONTROL_SEL_TIME1_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_SEL_TIME1_SHIFT) & MTGV2_FILTER_CONTROL_SEL_TIME1_MASK)
#define MTGV2_FILTER_CONTROL_SEL_TIME1_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_SEL_TIME1_MASK) >> MTGV2_FILTER_CONTROL_SEL_TIME1_SHIFT)

/*
 * SEL_TIME0 (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_SEL_TIME0_MASK (0xC00U)
#define MTGV2_FILTER_CONTROL_SEL_TIME0_SHIFT (10U)
#define MTGV2_FILTER_CONTROL_SEL_TIME0_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_SEL_TIME0_SHIFT) & MTGV2_FILTER_CONTROL_SEL_TIME0_MASK)
#define MTGV2_FILTER_CONTROL_SEL_TIME0_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_SEL_TIME0_MASK) >> MTGV2_FILTER_CONTROL_SEL_TIME0_SHIFT)

/*
 * EN_TIME1 (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_EN_TIME1_MASK (0x200U)
#define MTGV2_FILTER_CONTROL_EN_TIME1_SHIFT (9U)
#define MTGV2_FILTER_CONTROL_EN_TIME1_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_EN_TIME1_SHIFT) & MTGV2_FILTER_CONTROL_EN_TIME1_MASK)
#define MTGV2_FILTER_CONTROL_EN_TIME1_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_EN_TIME1_MASK) >> MTGV2_FILTER_CONTROL_EN_TIME1_SHIFT)

/*
 * EN_TIME0 (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_EN_TIME0_MASK (0x100U)
#define MTGV2_FILTER_CONTROL_EN_TIME0_SHIFT (8U)
#define MTGV2_FILTER_CONTROL_EN_TIME0_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_EN_TIME0_SHIFT) & MTGV2_FILTER_CONTROL_EN_TIME0_MASK)
#define MTGV2_FILTER_CONTROL_EN_TIME0_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_EN_TIME0_MASK) >> MTGV2_FILTER_CONTROL_EN_TIME0_SHIFT)

/*
 * A_EN (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_A_EN_MASK (0x40U)
#define MTGV2_FILTER_CONTROL_A_EN_SHIFT (6U)
#define MTGV2_FILTER_CONTROL_A_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_A_EN_SHIFT) & MTGV2_FILTER_CONTROL_A_EN_MASK)
#define MTGV2_FILTER_CONTROL_A_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_A_EN_MASK) >> MTGV2_FILTER_CONTROL_A_EN_SHIFT)

