hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_mtgv2_regs.h
/*
 * FF_MODE (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_FF_MODE_MASK (0x8U)
#define MTGV2_FILTER_CONTROL_FF_MODE_SHIFT (3U)
#define MTGV2_FILTER_CONTROL_FF_MODE_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_FF_MODE_SHIFT) & MTGV2_FILTER_CONTROL_FF_MODE_MASK)
#define MTGV2_FILTER_CONTROL_FF_MODE_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_FF_MODE_MASK) >> MTGV2_FILTER_CONTROL_FF_MODE_SHIFT)

/*
 * FF_EN (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_FF_EN_MASK (0x4U)
#define MTGV2_FILTER_CONTROL_FF_EN_SHIFT (2U)
#define MTGV2_FILTER_CONTROL_FF_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_FF_EN_SHIFT) & MTGV2_FILTER_CONTROL_FF_EN_MASK)
#define MTGV2_FILTER_CONTROL_FF_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_FF_EN_MASK) >> MTGV2_FILTER_CONTROL_FF_EN_SHIFT)

/*
 * FIRST_LOAD_MODE (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_MASK (0x2U)
#define MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_SHIFT (1U)
#define MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_SHIFT) & MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_MASK)
#define MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_MASK) >> MTGV2_FILTER_CONTROL_FIRST_LOAD_MODE_SHIFT)

/*
 * ENABLE (RW)
 *
 */
#define MTGV2_FILTER_CONTROL_ENABLE_MASK (0x1U)
#define MTGV2_FILTER_CONTROL_ENABLE_SHIFT (0U)
#define MTGV2_FILTER_CONTROL_ENABLE_SET(x) (((uint32_t)(x) << MTGV2_FILTER_CONTROL_ENABLE_SHIFT) & MTGV2_FILTER_CONTROL_ENABLE_MASK)
#define MTGV2_FILTER_CONTROL_ENABLE_GET(x) (((uint32_t)(x) & MTGV2_FILTER_CONTROL_ENABLE_MASK) >> MTGV2_FILTER_CONTROL_ENABLE_SHIFT)

/* Bitfield definition for register: FILTER_VEL_FF */
/*
 * VALUE (RW)
 *
 */
#define MTGV2_FILTER_VEL_FF_VALUE_MASK (0xFFFFFFFFUL)
#define MTGV2_FILTER_VEL_FF_VALUE_SHIFT (0U)
#define MTGV2_FILTER_VEL_FF_VALUE_SET(x) (((uint32_t)(x) << MTGV2_FILTER_VEL_FF_VALUE_SHIFT) & MTGV2_FILTER_VEL_FF_VALUE_MASK)
#define MTGV2_FILTER_VEL_FF_VALUE_GET(x) (((uint32_t)(x) & MTGV2_FILTER_VEL_FF_VALUE_MASK) >> MTGV2_FILTER_VEL_FF_VALUE_SHIFT)

/* Bitfield definition for register: FILTER_ACC_FF */
/*
 * VALUE (RW)
 *
 */
#define MTGV2_FILTER_ACC_FF_VALUE_MASK (0xFFFFFFFFUL)
#define MTGV2_FILTER_ACC_FF_VALUE_SHIFT (0U)
#define MTGV2_FILTER_ACC_FF_VALUE_SET(x) (((uint32_t)(x) << MTGV2_FILTER_ACC_FF_VALUE_SHIFT) & MTGV2_FILTER_ACC_FF_VALUE_MASK)
#define MTGV2_FILTER_ACC_FF_VALUE_GET(x) (((uint32_t)(x) & MTGV2_FILTER_ACC_FF_VALUE_MASK) >> MTGV2_FILTER_ACC_FF_VALUE_SHIFT)

/* Bitfield definition for register: FILTER_TIME_CONSTANT_TP */
/*
 * TP (RW)
 *
 */
#define MTGV2_FILTER_TIME_CONSTANT_TP_TP_MASK (0xFFFFFFUL)
#define MTGV2_FILTER_TIME_CONSTANT_TP_TP_SHIFT (0U)
#define MTGV2_FILTER_TIME_CONSTANT_TP_TP_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME_CONSTANT_TP_TP_SHIFT) & MTGV2_FILTER_TIME_CONSTANT_TP_TP_MASK)
#define MTGV2_FILTER_TIME_CONSTANT_TP_TP_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME_CONSTANT_TP_TP_MASK) >> MTGV2_FILTER_TIME_CONSTANT_TP_TP_SHIFT)

/* Bitfield definition for register: FILTER_TIME_CONSTANT_TZ */
/*
 * TZ (RW)
 *
 */
#define MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_MASK (0xFFFFFFUL)
#define MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_SHIFT (0U)
#define MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_SHIFT) & MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_MASK)
#define MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_MASK) >> MTGV2_FILTER_TIME_CONSTANT_TZ_TZ_SHIFT)

/* Bitfield definition for register: FILTER_TIME_CONSTANT_TZ_1 */
/*
 * TZ_1 (RW)
 *
 */
#define MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_MASK (0xFFFFFFUL)
#define MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SHIFT (0U)
#define MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SHIFT) & MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_MASK)
#define MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_MASK) >> MTGV2_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SHIFT)

/* Bitfield definition for register: FILTER_GAIN */
/*
 * GAIN_T0_EN (RW)
 *
 */
#define MTGV2_FILTER_GAIN_GAIN_T0_EN_MASK (0x80000000UL)
#define MTGV2_FILTER_GAIN_GAIN_T0_EN_SHIFT (31U)
#define MTGV2_FILTER_GAIN_GAIN_T0_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_GAIN_GAIN_T0_EN_SHIFT) & MTGV2_FILTER_GAIN_GAIN_T0_EN_MASK)
#define MTGV2_FILTER_GAIN_GAIN_T0_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_GAIN_GAIN_T0_EN_MASK) >> MTGV2_FILTER_GAIN_GAIN_T0_EN_SHIFT)

/*
 * GAIN_T1_EN (RW)
 *
 */
#define MTGV2_FILTER_GAIN_GAIN_T1_EN_MASK (0x40000000UL)
#define MTGV2_FILTER_GAIN_GAIN_T1_EN_SHIFT (30U)
#define MTGV2_FILTER_GAIN_GAIN_T1_EN_SET(x) (((uint32_t)(x) << MTGV2_FILTER_GAIN_GAIN_T1_EN_SHIFT) & MTGV2_FILTER_GAIN_GAIN_T1_EN_MASK)
#define MTGV2_FILTER_GAIN_GAIN_T1_EN_GET(x) (((uint32_t)(x) & MTGV2_FILTER_GAIN_GAIN_T1_EN_MASK) >> MTGV2_FILTER_GAIN_GAIN_T1_EN_SHIFT)

/*
 * K (RW)
 *
 */
#define MTGV2_FILTER_GAIN_K_MASK (0xFFFFFFUL)
#define MTGV2_FILTER_GAIN_K_SHIFT (0U)
#define MTGV2_FILTER_GAIN_K_SET(x) (((uint32_t)(x) << MTGV2_FILTER_GAIN_K_SHIFT) & MTGV2_FILTER_GAIN_K_MASK)
#define MTGV2_FILTER_GAIN_K_GET(x) (((uint32_t)(x) & MTGV2_FILTER_GAIN_K_MASK) >> MTGV2_FILTER_GAIN_K_SHIFT)

/* Bitfield definition for register: FILTER_STAGE_SHIFT0 */
/*
 * STAGE3_SHIFT1 (RW)
 *
 */
#define MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_MASK (0xF0000000UL)
#define MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SHIFT (28U)
#define MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SET(x) (((uint32_t)(x) << MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SHIFT) & MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_MASK)
#define MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_GET(x) (((uint32_t)(x) & MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_MASK) >> MTGV2_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SHIFT)

/* Bitfield definition for register: FILTER_STAGE_SHIFT1 */
/*
 * STAGE5_SHIFT1 (RW)
 *
 */
#define MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_MASK (0xF000U)
#define MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SHIFT (12U)
#define MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SET(x) (((uint32_t)(x) << MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SHIFT) & MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_MASK)
#define MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_GET(x) (((uint32_t)(x) & MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_MASK) >> MTGV2_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SHIFT)

/* Bitfield definition for register: FILTER_PARAM_SHIFT */
/*
 * ACC_SHIFT_PARAM (RW)
 *
 */
#define MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_MASK (0xF0000000UL)
#define MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SHIFT (28U)
#define MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SET(x) (((uint32_t)(x) << MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SHIFT) & MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_MASK)
#define MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_GET(x) (((uint32_t)(x) & MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_MASK) >> MTGV2_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SHIFT)

