hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_mtgv2_regs.h
/*
 * VEL_SHIFT_PARAM (RW)
 *
 */
#define MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_MASK (0xF000000UL)
#define MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SHIFT (24U)
#define MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SET(x) (((uint32_t)(x) << MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SHIFT) & MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_MASK)
#define MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_GET(x) (((uint32_t)(x) & MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_MASK) >> MTGV2_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SHIFT)

/*
 * GAIN_K_SHIFT (RW)
 *
 */
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_MASK (0xF00000UL)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SHIFT (20U)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SHIFT) & MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_MASK)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_MASK) >> MTGV2_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SHIFT)

/*
 * GAIN_T0_SHIFT (RW)
 *
 */
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_MASK (0xF0000UL)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SHIFT (16U)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SHIFT) & MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_MASK)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_MASK) >> MTGV2_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SHIFT)

/*
 * GAIN_T1_SHIFT (RW)
 *
 */
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_MASK (0xF000U)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SHIFT (12U)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SHIFT) & MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_MASK)
#define MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_MASK) >> MTGV2_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SHIFT)

/* Bitfield definition for register: FILTER_TIME_SHIFT */
/*
 * ACC_SHIFT_TIME1 (RW)
 *
 */
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_MASK (0xF000U)
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SHIFT (12U)
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SHIFT) & MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_MASK)
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_MASK) >> MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SHIFT)

/*
 * VEL_SHIFT_TIME1 (RW)
 *
 */
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_MASK (0xF00U)
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SHIFT (8U)
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SHIFT) & MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_MASK)
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_MASK) >> MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SHIFT)

/*
 * ACC_SHIFT_TIME0 (RW)
 *
 */
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_MASK (0xF0U)
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SHIFT (4U)
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SHIFT) & MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_MASK)
#define MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_MASK) >> MTGV2_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SHIFT)

/*
 * VEL_SHIFT_TIME0 (RW)
 *
 */
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_MASK (0xFU)
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SHIFT (0U)
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SHIFT) & MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_MASK)
#define MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_MASK) >> MTGV2_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SHIFT)

/* Bitfield definition for register: FILTER_FF_SHIFT */
/*
 * OUTPUT_ACC_SHIFT (RW)
 *
 */
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_MASK (0xF000U)
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SHIFT (12U)
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SHIFT) & MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_MASK)
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_MASK) >> MTGV2_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SHIFT)

/*
 * FILTER_ACC_SHIFT (RW)
 *
 */
#define MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_MASK (0xF00U)
#define MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SHIFT (8U)
#define MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SHIFT) & MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_MASK)
#define MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_MASK) >> MTGV2_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SHIFT)

/*
 * OUTPUT_VEL_SHIFT (RW)
 *
 */
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_MASK (0xF0U)
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SHIFT (4U)
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SHIFT) & MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_MASK)
#define MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_MASK) >> MTGV2_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SHIFT)

/*
 * FILTER_VEL_SHIFT (RW)
 *
 */
#define MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_MASK (0xFU)
#define MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SHIFT (0U)
#define MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SHIFT) & MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_MASK)
#define MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_MASK) >> MTGV2_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SHIFT)

/* Bitfield definition for register: FILTER_TIME1_SW_ADJUST */
/*
 * TIME (RW)
 *
 */
#define MTGV2_FILTER_TIME1_SW_ADJUST_TIME_MASK (0xFFFFFFUL)
#define MTGV2_FILTER_TIME1_SW_ADJUST_TIME_SHIFT (0U)
#define MTGV2_FILTER_TIME1_SW_ADJUST_TIME_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME1_SW_ADJUST_TIME_SHIFT) & MTGV2_FILTER_TIME1_SW_ADJUST_TIME_MASK)
#define MTGV2_FILTER_TIME1_SW_ADJUST_TIME_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME1_SW_ADJUST_TIME_MASK) >> MTGV2_FILTER_TIME1_SW_ADJUST_TIME_SHIFT)

/* Bitfield definition for register: FILTER_TIME0_SW_ADJUST */
/*
 * TIME (RW)
 *
 */
#define MTGV2_FILTER_TIME0_SW_ADJUST_TIME_MASK (0xFFFFFFUL)
#define MTGV2_FILTER_TIME0_SW_ADJUST_TIME_SHIFT (0U)
#define MTGV2_FILTER_TIME0_SW_ADJUST_TIME_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIME0_SW_ADJUST_TIME_SHIFT) & MTGV2_FILTER_TIME0_SW_ADJUST_TIME_MASK)
#define MTGV2_FILTER_TIME0_SW_ADJUST_TIME_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIME0_SW_ADJUST_TIME_MASK) >> MTGV2_FILTER_TIME0_SW_ADJUST_TIME_SHIFT)

/* Bitfield definition for register: FILTER_TIMEOUT_CNT */
/*
 * TIMEOUT_CNT (RW)
 *
 */
#define MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_MASK (0xFFFFFFFFUL)
#define MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SHIFT (0U)
#define MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SET(x) (((uint32_t)(x) << MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SHIFT) & MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_MASK)
#define MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_GET(x) (((uint32_t)(x) & MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_MASK) >> MTGV2_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SHIFT)

/* Bitfield definition for register: FILTER_REV_LOCK */
/*
 * REV_STATUS (RO)
 *
 */
#define MTGV2_FILTER_REV_LOCK_REV_STATUS_MASK (0xFFFFFFFFUL)
#define MTGV2_FILTER_REV_LOCK_REV_STATUS_SHIFT (0U)
#define MTGV2_FILTER_REV_LOCK_REV_STATUS_GET(x) (((uint32_t)(x) & MTGV2_FILTER_REV_LOCK_REV_STATUS_MASK) >> MTGV2_FILTER_REV_LOCK_REV_STATUS_SHIFT)

/* Bitfield definition for register: FILTER_POS_LOCK */
/*
 * POS_STATUS (RO)
 *
 */
#define MTGV2_FILTER_POS_LOCK_POS_STATUS_MASK (0xFFFFFFFFUL)
#define MTGV2_FILTER_POS_LOCK_POS_STATUS_SHIFT (0U)
#define MTGV2_FILTER_POS_LOCK_POS_STATUS_GET(x) (((uint32_t)(x) & MTGV2_FILTER_POS_LOCK_POS_STATUS_MASK) >> MTGV2_FILTER_POS_LOCK_POS_STATUS_SHIFT)

/* Bitfield definition for register: FILTER_VEL_LOCK */
/*
 * VEL_STATUS (RO)
 *
 */
#define MTGV2_FILTER_VEL_LOCK_VEL_STATUS_MASK (0xFFFFFFFFUL)
#define MTGV2_FILTER_VEL_LOCK_VEL_STATUS_SHIFT (0U)
#define MTGV2_FILTER_VEL_LOCK_VEL_STATUS_GET(x) (((uint32_t)(x) & MTGV2_FILTER_VEL_LOCK_VEL_STATUS_MASK) >> MTGV2_FILTER_VEL_LOCK_VEL_STATUS_SHIFT)

/* Bitfield definition for register: FILTER_ACC_LOCK */
/*
 * ACC_STATUS (RO)
 *
 */
#define MTGV2_FILTER_ACC_LOCK_ACC_STATUS_MASK (0xFFFFFFFFUL)
#define MTGV2_FILTER_ACC_LOCK_ACC_STATUS_SHIFT (0U)
#define MTGV2_FILTER_ACC_LOCK_ACC_STATUS_GET(x) (((uint32_t)(x) & MTGV2_FILTER_ACC_LOCK_ACC_STATUS_MASK) >> MTGV2_FILTER_ACC_LOCK_ACC_STATUS_SHIFT)



/* CMD register group index macro definition */
#define MTGV2_CMD_0 (0UL)
#define MTGV2_CMD_1 (1UL)
#define MTGV2_CMD_2 (2UL)
#define MTGV2_CMD_3 (3UL)

/* TRA register group index macro definition */
#define MTGV2_TRA_0 (0UL)
#define MTGV2_TRA_1 (1UL)

/* EVENT register group index macro definition */
#define MTGV2_EVENT_0 (0UL)
#define MTGV2_EVENT_1 (1UL)
#define MTGV2_EVENT_2 (2UL)
#define MTGV2_EVENT_3 (3UL)


#endif /* HPM_MTGV2_H */
